SpenceKonde/ATTinyCore/avr/boards.txt
attiny84nr.build.mcu=attiny84
attiny84nr.build.f_cpu=8000000L
attiny84nr.build.core=tiny
attiny84nr.build.variant=tinyX4optiboot
 
###########################################################################

attiny85.name=Optiboot ATtiny85 @ 8 MHz  (internal osc)

attiny85.upload.tool=arduino:avrdude
attiny85.upload.speed=19200
#bootloader takes up last 9 pages, so there is a limit on the max size.
attiny85.upload.maximum_size=7616

attiny85.bootloader.tool=avrdude
attiny85.bootloader.low_fuses=0xE2
attiny85.bootloader.high_fuses=0xD7
attiny85.bootloader.extended_fuses=0xFE
attiny85.bootloader.path=optiboot
attiny85.bootloader.file=optiboot_attiny85.hex

attiny85.build.mcu=attiny85
attiny85.build.f_cpu=8000000L
attiny85.build.core=tiny
attiny85.build.variant=tinyX5optiboot
 
###########################################################################

attiny88_1.name=ATtiny88 @ 1 MHz  (internal oscillator; BOD disabled)
attiny88_1.upload.tool=arduino:avrdude
attiny88_1.upload.maximum_size=8192
#attiny88_1.upload.protocol=avrispv2

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms; [CKSEL=1110 SUT=10]; default value
# Divide clock by 8 internally; [CKDIV8=0]
attiny88_1.bootloader.low_fuses=0x6E

# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]
attiny88_1.bootloader.high_fuses=0xD7

# Self-Programming Disabled; [SELFPRGEN=1]
attiny88_1.bootloader.extended_fuses=0x07

attiny88_1.bootloader.tool=avrdude
attiny88_1.bootloader.path=empty
attiny88_1.bootloader.file=empty88at1.hex
attiny88_1.build.mcu=attiny88
attiny88_1.build.f_cpu=1000000L
attiny88_1.build.core=tiny
attiny88_1.build.variant=tinyX8

###########################################################################

attiny88_8.name=ATtiny88 @ 8 MHz  (internal oscillator; BOD disabled)
attiny88_8.upload.tool=arduino:avrdude
attiny88_8.upload.maximum_size=8192
#attiny88_8.upload.protocol=avrispv2

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms; [CKSEL=1110 SUT=10]; default value
attiny88_8.bootloader.low_fuses=0xEE

# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]
attiny88_8.bootloader.high_fuses=0xD7

# Self-Programming Disabled; [SELFPRGEN=1]
attiny88_8.bootloader.extended_fuses=0x07

attiny88_8.bootloader.tool=avrdude
attiny88_8.bootloader.path=empty
attiny88_8.bootloader.file=empty88at8.hex
attiny88_8.build.mcu=attiny88
attiny88_8.build.f_cpu=8000000L
attiny88_8.build.core=tiny
attiny88_8.build.variant=tinyX8

###########################################################################

attiny88_1_nm.name=ATtiny88 @ 1 MHz  (internal oscillator; BOD disabled; No Millis!)
attiny88_1_nm.upload.tool=arduino:avrdude
attiny88_1_nm.upload.maximum_size=8192
#attiny88_1_nm.upload.protocol=avrispv2
attiny88_1_nm.bootloader.tool=avrdude

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms; [CKSEL=1110 SUT=10]; default value
# Divide clock by 8 internally; [CKDIV8=0]
attiny88_1_nm.bootloader.low_fuses=0x6E

# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]
attiny88_1_nm.bootloader.high_fuses=0xD7

# Self-Programming Disabled; [SELFPRGEN=1]
attiny88_1_nm.bootloader.extended_fuses=0x07

attiny88_1_nm.bootloader.path=empty
attiny88_1_nm.bootloader.file=empty88at1.hex
attiny88_1_nm.build.mcu=attiny88
attiny88_1_nm.build.f_cpu=1000000L
attiny88_1_nm.build.core=tinyNoMillis
attiny88_1_nm.build.variant=tinyX8

###########################################################################

attiny88_8_nm.name=ATtiny88 @ 8 MHz  (internal oscillator; BOD disabled; No Millis!)
attiny88_8_nm.upload.tool=arduino:avrdude
attiny88_8_nm.upload.maximum_size=8192
#attiny88_8_nm.upload.protocol=avrispv2
attiny88_8_nm.bootloader.tool=avrdude

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms; [CKSEL=1110 SUT=10]; default value
attiny88_8_nm.bootloader.low_fuses=0xEE

# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]
attiny88_8_nm.bootloader.high_fuses=0xD7

# Self-Programming Disabled; [SELFPRGEN=1]
attiny88_8_nm.bootloader.extended_fuses=0x07

attiny88_8_nm.bootloader.path=empty
attiny88_8_nm.bootloader.file=empty88at8.hex
attiny88_8_nm.build.mcu=attiny88
attiny88_8_nm.build.f_cpu=8000000L
attiny88_8_nm.build.core=tinyNoMillis
attiny88_8_nm.build.variant=tinyX8

###########################################################################
